Revit 2020 API
SolidGlass Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class SolidGlass
Visual Basic
Public NotInheritable Class SolidGlass
Visual C++
public ref class SolidGlass abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.SolidGlass
See Also
SolidGlass Members
Autodesk.Revit.DB.Visual Namespace